backend/app/controllers/foods_controller.rb

    def index
      foods = Food.all
---
SELECT "foods".* FROM "foods"

    def show
      food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def create
      food = Food.create(food_params)
---
INSERT INTO "foods" ("name", "c_rating", "m_rating", "r_rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Roman"], ["c_rating", 10], ["m_rating", 2], ["r_rating", 0], ["created_at", "2017-10-02 13:18:20.276620"], ["updated_at", "2017-10-02 13:18:20.276620"]]

    def destroy
      food = Food.find(params[:id])
      if food.destroy!
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 6]]

    def update
      food = Food.find(params[:id])
      if food.update_attributes(food_params)
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "foods" SET "name" = ?, "c_rating" = ?, "r_rating" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["name", "Not Roman But A Chicken In Diguise"], ["c_rating", 1], ["r_rating", 10], ["updated_at", "2017-10-02 13:30:56.607875"], ["id", 6]]